test/graphs/graph_test_07.mmd
flowchart TD
  subgraph level3_142["level3"]
    s111_138["s111"]
    c111_152["c111"]
    subgraph level2_144["level2"]
      s11_139["s11"]
      s10_140["s10"]
      s01_141["s01"]
      s00_142["s00"]
      c00_148["c00"]
      c01_149["c01"]
      c10_150["c10"]
      c11_151["c11"]
      subgraph level1_146["level1"]
        s1_143["s1"]
        s0_144["s0"]
        c0_146["c0"]
        c1_147["c1"]
        subgraph level0_148["level0"]
          x_145["x"]
        end
      end
    end
  end

  s111_138 --> s11_139;
  s11_139 --> s1_143;
  s10_140 --> s1_143;
  s01_141 --> s0_144;
  s00_142 --> s0_144;
  c11_151 --> c111_152;
  s1_143 --> x_145;
  s0_144 --> x_145;
  c0_146 --> c00_148;
  c0_146 --> c01_149;
  c1_147 --> c10_150;
  c1_147 --> c11_151;
  x_145 --> c0_146;
  x_145 --> c1_147;

classDef highlight fill:#FFFFAA,stroke:#333;
